src/cf/InformationRegisters/ПараметрыПодключенияRMQ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<InformationRegister>
		<Properties>
			<Name>ПараметрыПодключенияRMQ</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Адрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Порт</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Логин</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Пароль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВиртуальныйХост</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИмяОчереди</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТочкаОбмена</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИмяОбмена</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/ОчередьRMQ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<InformationRegister>
		<Properties>
			<Name>ОчередьRMQ</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сообщение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Маршрутизация</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ID</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Documents/Заказ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Document>
		<Properties>
			<Name>Заказ</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.СвободныеОстатки</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗаказов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерCRM</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/CommonModules/RMQ/Ext/Module.bsl
Процедура РегламентноеЗадание_ОтправитьВRMQ() Экспорт
	
	//1. Остатки товаров 
	Маршрут = "CRM_remaining";  
	ПараметрыRMQ = РегистрыСведений.ПараметрыПодключенияRMQ.ПолучитьНастройки(Маршрут);
	Если ПараметрыRMQ = Неопределено Тогда
		ВызватьИсключение "Не заданы параметры подключения "+Маршрут;
	КонецЕсли;
	
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОчередьRMQ.ID КАК ID,
		|	ОчередьRMQ.Сообщение КАК Сообщение,
		|	ОчередьRMQ.Маршрутизация КАК Маршрутизация
		|ИЗ
		|	РегистрСведений.ОчередьRMQ КАК ОчередьRMQ
		|ГДЕ
		|	ОчередьRMQ.Маршрутизация = &Маршрутизация";
	Запрос.УстановитьПараметр("Маршрутизация",Маршрут);
	РезультатЗапроса = Запрос.Выполнить(); 
	Если НЕ РезультатЗапроса.Пустой() Тогда
		КлиентКомпоненты = ПолучитьКомпонентуСервер();
		КлиентКомпоненты.Connect(ПараметрыRMQ.Адрес,ПараметрыRMQ.Порт,ПараметрыRMQ.Логин,ПараметрыRMQ.Пароль,ПараметрыRMQ.ВиртуальныйХост);
		
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл 			
			Попытка							
				КлиентКомпоненты.BasicPublish(ПараметрыRMQ.ТочкаОбмена,Выборка.Маршрутизация,Выборка.Сообщение,1,Ложь); 
				
				//очистка очереди из 1С
				МЗ = РегистрыСведений.ОчередьRMQ.СоздатьМенеджерЗаписи();
				МЗ.ID = Выборка.ID; 
				МЗ.Удалить();
				
			Исключение
				СистемнаяОшибка = ОписаниеОшибки();
				ТекстСообщения = "Ошибка отправки сообщения!%СистемнаяОшибка%";
				ТекстСообщения = СтрЗаменить(ТекстСообщения, "%СистемнаяОшибка%", СистемнаяОшибка);
				ВызватьИсключение ТекстСообщения;
			КонецПопытки;
					
		КонецЦикла;
	КонецЕсли;
	
	//2. Статусы заказов 
	Маршрут = "CRM_OrderStatus";  
	ПараметрыRMQ = РегистрыСведений.ПараметрыПодключенияRMQ.ПолучитьНастройки(Маршрут);
	Если ПараметрыRMQ = Неопределено Тогда
		ВызватьИсключение "Не заданы параметры подключения "+Маршрут;
	КонецЕсли;
	
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОчередьRMQ.ID КАК ID,
		|	ОчередьRMQ.Сообщение КАК Сообщение,
		|	ОчередьRMQ.Маршрутизация КАК Маршрутизация
		|ИЗ
		|	РегистрСведений.ОчередьRMQ КАК ОчередьRMQ
		|ГДЕ
		|	ОчередьRMQ.Маршрутизация = &Маршрутизация";
	Запрос.УстановитьПараметр("Маршрутизация",Маршрут);
	РезультатЗапроса = Запрос.Выполнить(); 
	Если НЕ РезультатЗапроса.Пустой() Тогда
		КлиентКомпоненты = ПолучитьКомпонентуСервер();
		КлиентКомпоненты.Connect(ПараметрыRMQ.Адрес,ПараметрыRMQ.Порт,ПараметрыRMQ.Логин,ПараметрыRMQ.Пароль,ПараметрыRMQ.ВиртуальныйХост);
		
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл 			
			Попытка							
				КлиентКомпоненты.BasicPublish(ПараметрыRMQ.ТочкаОбмена,Выборка.Маршрутизация,Выборка.Сообщение,1,Ложь); 
				
				//очистка очереди из 1С
				МЗ = РегистрыСведений.ОчередьRMQ.СоздатьМенеджерЗаписи();
				МЗ.ID = Выборка.ID; 
				МЗ.Удалить();
				
			Исключение
				СистемнаяОшибка = ОписаниеОшибки();
				ТекстСообщения = "Ошибка отправки сообщения!%СистемнаяОшибка%";
				ТекстСообщения = СтрЗаменить(ТекстСообщения, "%СистемнаяОшибка%", СистемнаяОшибка);
				ВызватьИсключение ТекстСообщения;
			КонецПопытки;
					
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Процедура РегламентноеЗадание_ПрочитатьRMQ() Экспорт
	Маршрут = "CRM_NewOrder";  
	ПараметрыRMQ = РегистрыСведений.ПараметрыПодключенияRMQ.ПолучитьНастройки(Маршрут);
	Если ПараметрыRMQ = Неопределено Тогда
		ВызватьИсключение "Не заданы параметры подключения "+Маршрут;
	КонецЕсли;
	
	
	Попытка
		КлиентКомпоненты = ПолучитьКомпонентуСервер();
		КлиентКомпоненты.Connect(ПараметрыRMQ.Адрес,ПараметрыRMQ.Порт,ПараметрыRMQ.Логин,ПараметрыRMQ.Пароль,ПараметрыRMQ.ВиртуальныйХост);	
		КлиентКомпоненты.DeclareQueue(ПараметрыRMQ.ИмяОчереди, Истина, Истина, Ложь, Ложь);
		
		Потребитель = КлиентКомпоненты.BasicConsume(ПараметрыRMQ.ИмяОчереди, "", Истина, Ложь, 0);
		
		ОтветноеСообщение = "";
		Пока КлиентКомпоненты.BasicConsumeMessage("", ОтветноеСообщение, 5) Цикл		
			ЗагрузитьОбновитьЗаказ(ОтветноеСообщение);			
			КлиентКомпоненты.BasicAck();
		КонецЦикла;
		
		КлиентКомпоненты.BasicCancel("");
	Исключение
		ВызватьИсключение КлиентКомпоненты.GetLastError();
	КонецПопытки;
КонецПроцедуры  

Процедура ЗагрузитьОбновитьЗаказ(СтрокаJSON)
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(СтрокаJSON);  
	Данные = ПрочитатьJSON(ЧтениеJSON);            
	ЧтениеJSON.Закрыть();
	
	ЗаказСсылка = Документы.Заказ.НайтиПоРеквизиту("НомерCRM",Данные.Номер);
	Если ЗначениеЗаполнено(ЗаказСсылка) Тогда
		//не обновлять		
	Иначе
		ЗаказОбъект = Документы.Заказ.СоздатьЭлемент();
		ЗаказОбъект.НомерCRM = Данные.Номер;
	КонецЕсли; 
	ЗаказОбъект.Контрагент = Справочники.Контрагенты.НайтиПоРеквизиту("КодCRM",Данные.КодКонтрагента); 
	Для каждого стрТовара из Данные.Товары Цикл
		НовСтр = ЗаказОбъект.Товары.Добавить();
		НовСтр.Количество = стрТовара.Количество;
		НовСтр.Сумма = стрТовара.Сумма;
		НовСтр.Номенклатура = Справочники.Номенклатура.НайтиПоРеквизиту("КодCRM",стрТовара.КодНоменклатуры);
	КонецЦикла;
	ЗаказОбъект.Записать(РежимЗаписиДокумента.Проведение);	
КонецПроцедуры

Функция ПолучитьКомпонентуСервер()
	
	КлиентКомпоненты = Неопределено;
	Если Не ИнициализироватьКомпонентуКлиентСервер(КлиентКомпоненты) Тогда
		
		ПодключитьКомпонентуСервер();
		ИнициализироватьКомпонентуКлиентСервер(КлиентКомпоненты);
		
	КонецЕсли;
	
	Возврат КлиентКомпоненты;
КонецФункции  

Процедура ПодключитьКомпонентуСервер(КомпонентаПодключена = Неопределено)
	
	
	МакетВнешнейКомпоненты    = ПолучитьОбщийМакет("КомпонентаRMQ");
	АдресВоВременномХранилище = ПоместитьВоВременноеХранилище(МакетВнешнейКомпоненты, Новый УникальныйИдентификатор());
	
	КомпонентаПодключена = ПодключитьВнешнююКомпоненту(
			АдресВоВременномХранилище,
			"BITERP",
			ТипВнешнейКомпоненты.Native);
	Сообщить(НСтр("ru = 'Компонента подключена!'"));
КонецПроцедуры

Функция ИнициализироватьКомпонентуКлиентСервер(Компонента)
	
	Попытка
		Компонента  = Новый("AddIn.BITERP.PinkRabbitMQ");
		Возврат Истина;
	Исключение
		Возврат Ложь;
	КонецПопытки;
	
КонецФункции
